In [1]:
import pandas as pd
from datetime import datetime

In [3]:
df=pd.read_csv("C:/Users/acer/Desktop/employee.csv")

In [4]:
df

   EmployeeID   Department  Salary JoiningDate
0         101           HR   50000    03-15-18
1         102      Finance   65000    07-20-19
2         103  Engineering   85000    01-10-16
3         104           HR   55000    11-05-20
4         105      Finance   70000    08-25-17

In [5]:
df['JoiningDate'] = pd.to_datetime(df['JoiningDate'])

In [6]:
S=df['Salary'].max()

In [7]:
df.loc[df[df['Salary'] == S].index,'Department']

2    Engineering
Name: Department, dtype: object

In [8]:
df.groupby("Department")["Salary"].mean()

Department
Engineering    85000.0
Finance        67500.0
HR             52500.0
Name: Salary, dtype: float64

In [9]:
average_salary = df.groupby("Department")["Salary"].mean()
print("Average Salary by Department:")
print(average_salary)

Average Salary by Department:
Department
Engineering    85000.0
Finance        67500.0
HR             52500.0
Name: Salary, dtype: float64

In [10]:
#department with the highest average salary
highest_avg_dept = df.loc[[df['Salary'].idxmax()],'Department']
print(f"\nDepartment with the highest average salary: {highest_avg_dept}")

Department with the highest average salary: 2    Engineering
Name: Department, dtype: object

In [11]:
highest_avg_dept = average_salary.idxmax()
print(f"\nDepartment with the highest average salary: {highest_avg_dept}")

Department with the highest average salary: Engineering

In [12]:
current=datetime.now()

In [17]:
df['Experience']=df['JoiningDate'].apply(lambda x: current.year - x.year - ((current.month, current.day) < (x.month, x.day)))

In [18]:
df

   EmployeeID   Department  Salary JoiningDate  Experience
0         101           HR   50000  2018-03-15           6
1         102      Finance   65000  2019-07-20           5
2         103  Engineering   85000  2016-01-10           8
3         104           HR   55000  2020-11-05           4
4         105      Finance   70000  2017-08-25           7

In [20]:
df[df['Experience']>5]

   EmployeeID   Department  Salary JoiningDate  Experience
0         101           HR   50000  2018-03-15           6
2         103  Engineering   85000  2016-01-10           8
4         105      Finance   70000  2017-08-25           7

# Sales Data

In [21]:
df=pd.read_csv("C:/Users/acer/Desktop/salesdata.csv")

In [22]:
df

   TransactionID   Product     Category  Price        Date
0              1     Shoes     Clothing    100  15-01-2024
1              2  T-Shirts     Clothing     50  10-02-2024
2              3      Bags  Accessories    200  05-03-2024
3              4     Shoes     Clothing    150  20-01-2024
4              5  T-Shirts     Clothing     70  15-02-2024
5              6      Bags  Accessories    250  12-03-2024
6              7     Shoes     Clothing    120  25-01-2024

In [23]:
X=df.groupby('Product')['Price'].sum()

In [24]:
X[X>5000]

Series([], Name: Price, dtype: int64)

In [25]:
df.groupby('Category')['Price'].mean()

Category
Accessories    225.0
Clothing        98.0
Name: Price, dtype: float64

In [26]:
df['Date']=pd.to_datetime(df['Date'])

C:\Users\acer\AppData\Local\Temp\ipykernel_15328\3023999556.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['Date']=pd.to_datetime(df['Date'])

In [27]:
df

   TransactionID   Product     Category  Price       Date
0              1     Shoes     Clothing    100 2024-01-15
1              2  T-Shirts     Clothing     50 2024-10-02
2              3      Bags  Accessories    200 2024-05-03
3              4     Shoes     Clothing    150 2024-01-20
4              5  T-Shirts     Clothing     70 2024-02-15
5              6      Bags  Accessories    250 2024-12-03
6              7     Shoes     Clothing    120 2024-01-25

In [28]:
df['Month']=df['Date'].dt.month

In [29]:
df

   TransactionID   Product     Category  Price       Date  Month
0              1     Shoes     Clothing    100 2024-01-15      1
1              2  T-Shirts     Clothing     50 2024-10-02     10
2              3      Bags  Accessories    200 2024-05-03      5
3              4     Shoes     Clothing    150 2024-01-20      1
4              5  T-Shirts     Clothing     70 2024-02-15      2
5              6      Bags  Accessories    250 2024-12-03     12
6              7     Shoes     Clothing    120 2024-01-25      1

In [30]:
df.groupby('Month')['Price'].sum()

Month
1     370
2      70
5     200
10     50
12    250
Name: Price, dtype: int64

In [36]:
#Icategory which has the highest total sales for each month
sales_by_category_month=df.groupby(["Month", "Category"])['Price'].sum().unstack()
sales_by_category_month

Category  Accessories  Clothing
Month
1                 NaN     370.0
2                 NaN      70.0
5               200.0       NaN
10                NaN      50.0
12              250.0       NaN

In [32]:
sales_by_category_month.idxmax(axis=1)

Month
1        Clothing
2        Clothing
5     Accessories
10       Clothing
12    Accessories
dtype: object

In [33]:
df['Year']=df['Date'].dt.year

In [34]:
df

   TransactionID   Product     Category  Price       Date  Month  Year
0              1     Shoes     Clothing    100 2024-01-15      1  2024
1              2  T-Shirts     Clothing     50 2024-10-02     10  2024
2              3      Bags  Accessories    200 2024-05-03      5  2024
3              4     Shoes     Clothing    150 2024-01-20      1  2024
4              5  T-Shirts     Clothing     70 2024-02-15      2  2024
5              6      Bags  Accessories    250 2024-12-03     12  2024
6              7     Shoes     Clothing    120 2024-01-25      1  2024